#define _CRT_SECURE_NO_WARNINGS  //解决不安全访问警告/报错问题
#include<stdio.h>
#include<math.h>
#include<stdlib.h>
#include<string.h>
#include<Windows.h>

//整型在内存中的存储

////设计程序判断当前机器的字节序
//int check_sys()
//{
//	int a = 1;
//	//指针类型决定了指针解引用时访问的字节个数
//	//char* p：*p访问了1个字节；int* p：*p访问了4个字节；
//	char* p = (char*)&a;
//	/*if (*p == 1)
//		return 1;
//	else
//		return 0;*/
//	return *p;
//}
//int main()
//{
//	//返回0，大端
//	//返回1，小端
//	int rec = check_sys();
//	if (rec == 1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//	return 0;
//}

//int main()
//{
//	char a = -1;
//	//原码：10000000 00000000 00000000 00000001
//	//反码：11111111 11111111 11111111 11111110
//	//补码：11111111 11111111 11111111 11111111
//	//char a只存储了补码的最后8位 11111111
//	//最后输出的 a 为整形，需要将8位char a补回32位int a
//	//高位补位，补符号位1：11111111 11111111 11111111 11111111
//	//找回原码，输出a=-1
//	signed char b = -1;
//	//地址存入 11111111
//	//与a同理
//	unsigned char c = -1;
//	//地址存入 11111111
//	//c为无符号数，高位补0：00000000 00000000 00000000 11111111
//	//c输出255
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	return 0;
//}

//int main()
//{
//	char a = -128;
//	//原码：10000000 00000000 00000000 10000000
//	//反码：11111111 11111111 11111111 01111111
//	//补码：11111111 11111111 11111111 10000000
//	//存入10000000
//	//高位补符号位1：11111111 11111111 11111111 10000000
//	printf("%u\n", a);//打印十进制无符号数字、
//	//输出为无符号数，原码=补码=11111111 11111111 11111111 10000000=4294967168
//	return 0;
//}

//int main()
//{
//	int i = -20;
//	//10000000 00000000 00000000 00010100--原码
//	//11111111 11111111 11111111 11101011--反码
//	//11111111 11111111 11111111 11101100--补码
//	unsigned int j = 10;
//	//00000000 00000000 00000000 00001010--原码=补码
//	printf("%d\n", i + j);
//	//11111111 11111111 11111111 11110110--i+j(补码)
//	//11111111 11111111 11111111 11110101--反码
//	//10000000 00000000 00000000 00001010--原码=-10
//	return 0;
//}

//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//		Sleep(100);
//	}
//	return 0;
//}

//int main()
//{
//	char a[1000];
//	//a[1000]={-1,-2,...,-128,127,126,...,2,1,0,-1,...}
//	//char的取值范围为-128 ~ 127；\0的ASCII码值为0
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));
//	return 0;
//}

int main()
{
	unsigned char i = 0;//范围：0-255
	for (i = 0; i <= 255; i++)
		printf("hello world\n");
	return 0;
}//死循环


//浮点型在内存中的存储

int main()
{

	return 0;
}